
var data = {
  novena:[
      {
            day:"ഒന്നാം ദിനം",
            prayer:"ഓ, എന്റെ ദൈവമേ! ആത്മാക്കൾക്കായി ഞാൻ അർപ്പിക്കുന്ന ബലികളും പ്രാർത്ഥനകളും പരിഹാരപ്രവൃത്തികളും സദയം സ്വീകരിച്ച്, പരിശുദ്ധ കന്യകാമറിയത്തിന്റെയും സ്വർഗ്ഗത്തിലുള്ള സകല വിശുദ്ധരുടെയും മദ്ധ്യസ്ഥതയാൽ അവരുടെ പാപക്കറകളിൽനിന്ന് ശുദ്ധീകൃതരായി മാലാഖമാരോടൊപ്പം അങ്ങയുടെ ദിവ്യദർശനം പ്രാപിക്കാൻ യോഗ്യരായിത്തീരുമാറാകട്ടെ. ദിവ്യനാഥാ, ഏറ്റവും താഴ്മയോടെ ഞാൻ അപേക്ഷിക്കുന്നു, അങ്ങയുടെ തിരുഹിതത്തിനനുസൃതമായി എന്റെ സഹോദരരെ സേവിക്കാനും എന്റെ നിത്യരക്ഷ നേടാനും വേണ്ട അനുഗ്രഹം എനിക്കു നൽകണമേ. അങ്ങനെ അവസാനം നല്ല മരണം ലഭിക്കാനും സ്വർഗ്ഗത്തിൽ നിത്യാനന്ദം അനുഭവിക്കാനും ഇടവരുത്തണമേ. വിശുദ്ധമായ ഒരു ജീവിതം നയിക്കാൻ എന്നെ അനുഗ്രഹിക്കണമേ. അതുവഴി എന്റെ ജീവിതാന്തസ്സിന്റെ കടമകൾ ശരിയായി നിറവേറ്റാൻ ഇടയാക്കണമേ. ഏറ്റവും വിനയപൂർവം ഞാൻ അപേക്ഷിക്കുന്ന ഈ പ്രത്യേക അനുഗ്രഹം, അങ്ങയുടെ ഉപരിമഹത്വത്തിനും ആത്മാക്കളുടെ രക്ഷയ്ക്കും ശുദ്ധീകരണസ്ഥലത്തിലെ ആത്മാക്കളുടെ വേദനകളിൽനിന്നുള്ള മോചനത്തിനും ഇടയാകട്ടെ."
      },

      {
            day:"രണ്ടാം ദിനം",
            prayer:"കരുണാമയനായ കർത്താവേ, അങ്ങിൽ ആശ്രയം തേടിവരുന്നവരോട് അങ്ങ് എല്ലായ്പ്പോഴും കാരുണ്യം പ്രദർശിപ്പിക്കുന്നുവല്ലോ. തന്റെ പുത്രന്റെ പീഡാനുഭവവേളയിൽ കുരിശിൻ ചുവട്ടിൽനിന്ന മാതാവിന്റെ യോഗ്യതകളാൽ ശുദ്ധീകരണസ്ഥലത്തെ ആത്മാക്കളെ മോചിപ്പിക്കണമെന്ന് അങ്ങയുടെ മുൻപിൽ സാഷ്ടാംഗം പ്രണമിച്ച് പ്രാർത്ഥിക്കുന്നു. ശുദ്ധീകരണസ്ഥലത്ത് വേദന അനുഭവിക്കുന്ന ദാസന്മാരും ദാസിമാരും ദണ്ഡവിമോചനം വഴി പാപത്തിന്റെ ശിക്ഷയിൽ നിന്ന് മോചിതരാകട്ടെ. അതുവഴി യഥാസമയം നീതിയുടെയും സ്നേഹത്തിന്റെയും രാജ്യത്തിൽ പ്രവേശിക്കുമാറാകട്ടെ. അങ്ങയുടെ ഉപരിമഹത്വത്തിനും ആത്മാക്കളുടെ രക്ഷയ്ക്കുംവേണ്ടി ഈ നൊവേനയിലെ എന്റെ യാചന കേൾക്കുമാറാകണമേ, ആമ്മേൻ."
      },

      {
            day:"മൂന്നാം ദിനം",
            prayer:"സർവ്വശക്തനായ പിതാവേ, അങ്ങേ ദാസന്മാരുടെയും ദാസിമാരുടെയും അർത്ഥന അങ്ങ് ഒരിക്കലും നിരസിച്ചിട്ടില്ലല്ലോ. ശുദ്ധീകരസ്ഥലത്തെ ആത്മാക്കൾ പരിശുദ്ധ കന്യകാമറിയത്തിന്റെ പുണ്യയോഗ്യതകളാൽ സ്വർഗ്ഗത്തിൽ എത്തിച്ചേർന്ന് അങ്ങയുടെ തിരുമുഖം കാണാനാകുമെന്ന പ്രതീക്ഷയിൽ തങ്ങളനുഭവിക്കുന്ന വേദനകൾ സഹിക്കാൻ ശക്തി കണ്ടെത്തട്ടെ. ഇപ്പോഴും ശുദ്ധീകരണസ്ഥലത്തു കഴിയുന്ന ആത്മാക്കളെയും, പ്രത്യേകിച്ച് ഈ നൊവേന ആർക്കായി അർപ്പിക്കുന്നുവോ അവരെയും കനിവോടെ ഓർക്കണമേ. ഈ യാചന അങ്ങയുടെ ഉപരിമഹത്വത്തിനും ആത്മാക്കളുടെ രക്ഷയ്ക്കും വേണ്ടി കേൾക്കുമാറാകണമേ, ആമ്മേൻ."
      },

      {
            day:"നാലാം ദിനം",
            prayer:"അത്യുന്നതനായ ദൈവമേ, ഇപ്പോൾ അവിടുത്തെ തിരുസന്നിധിയിലായിരിക്കാൻ വിശുദ്ധർക്കു കഴിയുന്നത് അങ്ങയുടെ കരുണയാലാണല്ലോ. പരിശുദ്ധ കന്യകാമറിയത്തിന്റെ മാതാപിതാക്കളായ വിശുദ്ധ യോവാക്കിമിന്റെയും അന്നയുടെയും മദ്ധ്യസ്ഥതയാൽ വരപ്രസാദാവസ്ഥയിൽ മരണമടഞ്ഞ അവിടുത്തെ ദാസരെ കരുണയോടെ കടാക്ഷിക്കണമെന്ന് അപേക്ഷിക്കുന്നു. ഈ നൊവേനയിൽ ഞങ്ങൾ അനുസ്മരിക്കുന്ന അങ്ങയുടെ ദാസന്മാരുടെയും ദാസിമാരുടെയും ആത്മാക്കളുടെമേൽ അവിടുത്തെ കാരുണ്യമുണ്ടാകുമാറാകട്ടെ . അതുവഴി അവർ പാപമോചനവും ശിക്ഷയിൽനിന്നു വിടുതലും പ്രാപിക്കട്ടെ. അങ്ങയുടെ കരുണയുടെ കരങ്ങളെ ആശ്രയിച്ച് ഞങ്ങൾ പ്രത്യേകമായി യാചിക്കുന്ന അനുഗ്രഹം അങ്ങയുടെ ഉപരിമഹത്വത്തിനും ആത്മാക്കളുടെ രക്ഷയ്ക്കും വേണ്ടി കനിവോടെ നൽകുമാറാകണമേ, ആമ്മേൻ."
      },

      {
            day:"അഞ്ചാം ദിനം",
            prayer:"ഓ! നിത്യനായ ദൈവമേ, അങ്ങേ കാരുണ്യത്തിന് അതിരുകളില്ലല്ലോ. പരിശുദ്ധ കന്യകാമറിയം, അങ്ങേ തിരുഹൃദയം കാൽവരിമലയിൽവച്ച് കുന്തത്താൽ പിളർക്കപ്പെട്ടപ്പോഴും സ്വന്തം ഹൃദയം മനുഷ്യരുടെ നന്ദിഹീനതയാകുന്ന വാൾമുനയാൽ പിളർക്കപ്പെട്ടപ്പോഴുമുണ്ടായ വേദനകൾ സ്നേഹത്തോടെ സഹിച്ചതിനെയോർത്ത്, മുഖ്യദൂതനായ വിശുദ്ധ മിഖായേലിന്റെ യോഗ്യതകളെ ഓർത്ത്, ശുദ്ധീകരണസ്ഥലത്തെ ആത്മാക്കൾക്ക് നിത്യശാന്തിയും മഹത്ത്വവും നൽകുമാറാകണമേ. കർത്താവേ, പാപികളോടു കരുണയായിരിക്കണമേ അങ്ങയുടെ സംരക്ഷണത്തിന്റെ മേലങ്കിയാൽ എന്നെ പൊതിയണമേ അതുവഴി ഞാൻ ആത്മാക്കൾക്കുവേണ്ടി അർപ്പിക്കുന്ന പ്രാർത്ഥന ഫലമണിയാൻ ഇടയാകട്ടെ. ഈ നൊവേന വഴി ഞാൻ അർപ്പിക്കുന്ന ഈ യാചന, അവിടുത്തെ ഉപരിമഹത്വത്തിനും ആത്മാക്കളുടെ രക്ഷയ്ക്കും വേണ്ടി കനിവോടെ നൽകുമാറാകണമേ, ആമ്മേൻ."
       },

      {
            day:"ആറാം ദിനം",
            prayer:"ഓ! എന്റെ മാധുര്യവാനായ ഈശോയേ, എല്ലാ ഹൃദയങ്ങളുടെയും രാജാവേ, ശുദ്ധീകരണസ്ഥലത്തിലെ ആത്മാക്കൾക്ക് അങ്ങയുടെ സ്നേഹപൂർണ്ണമായ പരിപാലനയും സമാധാനവും നൽകണമേ. മഹത്വമേറിയ വിശുദ്ധ ലോറൻസിന്റെ യോഗ്യതകളാലും സ്വന്തം പുത്രൻ ആണികളാൽ തറയ്ക്കപ്പെടുന്നതുകണ്ടു പരിശുദ്ധ മാതാവ് അനുഭവിച്ച വേദനകളോർത്തും ശുദ്ധീകരണാത്മാക്കൾക്ക് സ്വർഗ്ഗത്തിൽ അങ്ങയെ നിത്യം ദർശിക്കുവാൻ ഇടനല്കണമേ. ശുദ്ധീകരണസ്ഥലത്തെ ആത്മാക്കളോടും ഈ നൊവേനയിൽ പ്രത്യേകമായി അനുസ്മരിക്കുന്ന ആത്മാക്കളോടും കാരുണ്യത്തോടും സ്നേഹത്തോടും കൂടെ വർത്തിക്കണമേ. ഈ യാചന അങ്ങയുടെ ഉപരിമഹത്വത്തിനും ആത്മാക്കളുടെ രക്ഷയ്ക്കും വേണ്ടി നൽകുമാറാകണമേ, ആമ്മേൻ."
       },

      {
            day:"ഏഴാം ദിനം ",
            prayer:"കരുണാമയനായ കർത്താവേ, അങ്ങേ മാലാഖമാരുടെ യോഗ്യതകളാലും തന്റെ പുത്രന്റെ ചേതനയറ്റ ശരീരം കുരിശിൽ നിന്നിറക്കി മടിയിൽ കിടത്തിയപ്പോൾ അങ്ങേ മാതാവ് അനുഭവിച്ച വേദനയെ ഓർത്തും ആത്മാക്കൾക്കുവേണ്ടിയുള്ള എന്റെ പ്രാർത്ഥന കേട്ട് അവർ നിത്യഭവനമായ സ്വർഗ്ഗത്തിൽ എത്തിച്ചേർന്ന് നിത്യാനന്ദമനുഭവിക്കാൻ ഇടയാക്കണമേ. ഈ ലോകത്തിൽനിന്നു യാത്രയായ അങ്ങയുടെ ദാസീദാസന്മാർക്കും, പ്രത്യേകിച്ച് എനിക്ക് ഏറ്റവും പ്രിയപ്പെട്ട ആത്മാക്കൾക്കും നിത്യശാന്തി നൽകണമേ. നിത്യപ്രകാശം അവരുടെമേൽ പ്രകാശിക്കുകയും ചെയ്യുമാറാകട്ടെ. കർത്താവേ, എന്നെ സഹായിക്കാൻ വേഗം വരണമേ. ഈ യാചന അങ്ങയുടെ ഉപരിമഹത്വത്തിനും ആത്മാക്കളുടെ രക്ഷയ്ക്കും വേണ്ടി നൽകുമാറാകണമേ, ആമ്മേൻ."
       },

      {
            day:"എട്ടാം ദിനം",
            prayer:"ഓ! അനന്തസ്നേഹപൂർണനും കാരുണ്യവാനുമായ ഈശോയേ, വിശുദ്ധ ഫ്രാൻസിസ് അസ്സീസിയുടെയും തൊളന്തീനോയിലെ വിശുദ്ധ നിക്കോളാസിന്റെയും യോഗ്യതകളാലും, തന്റെ പുത്രന്റെ ശരീരം കുരിശിൽ നിന്നിറക്കി കച്ചകളാൽ പൊതിഞ്ഞ് സംസ്കരിക്കാനൊരുക്കുന്നതുകണ്ടപ്പോൾ പരിശുദ്ധ കന്യകാമറിയം സഹിച്ച വേദനകളോർത്തും എല്ലാ മരിച്ചവിശ്വാസികളും തങ്ങളുടെ പാപത്തിൽനിന്നു മോചിതരായി ദൈവനീതിയുടെ വിധിയിൽ നിന്ന് രക്ഷപ്പെടുമാറാകട്ടെ. ഈ ലോകത്തിൽനിന്ന് യാത്രയായ അങ്ങയുടെ ദാസന്മാരുടെയും ദാസിമാരുടെയും ആത്മാക്കൾ നിത്യമായ സമാധാനത്തിലേക്കും പ്രകാശത്തിലേക്കും പ്രവേശിക്കുമാറാകട്ടെ. കർത്താവേ, അവർ മരണത്താൽ നിന്റെ ജീവനിലേക്ക് പ്രവേശിക്കട്ടെ. ഞാൻ നടത്തുന്ന ഈ നൊവേന അവരുടെ വേദനകൾക്ക് ആശ്വാസമുണ്ടാക്കട്ടെ. ഈ യാചനകൾ അങ്ങയുടെ ഉപരിമഹത്വത്തിനും ആത്മാക്കളുടെ രക്ഷയ്ക്കും വേണ്ടി നൽകുമാറാകണമേ, ആമ്മേൻ."
       },

      {
            day:"ഒൻപതാം ദിനം",
            prayer:"ഓ, എന്റെ കർത്താവും സ്രഷ്ടാവുമായ ദൈവമേ, ഈ ലോകത്തിൽനിന്നു വേർപിരിഞ്ഞ ആത്മാക്കൾക്കായി പ്രത്യേകിച്ച് ഇവിടെ വച്ച് എന്നെ സഹായിച്ചിട്ടുള്ള ആത്മാക്കൾക്കായി ഞാൻ അർപ്പിക്കുന്ന ഈ നൊവേന കൈക്കൊണ്ട് അവരോട് കരുണയായിരിക്കണമേ. തന്റെ പുത്രന്റെ ശരീരം സംസ്കരിക്കാൻ കൊണ്ടുപോകുന്നതു കണ്ടപ്പോൾ പരിശുദ്ധ മാതാവ് അനുഭവിച്ച ദുഃഖങ്ങളോർത്ത് ഈ ദാസർക്ക് നിത്യശാന്തി നൽകണമേ. ഞാൻ നേടിയ ദണ്ഡവിമോചനംവഴി അവർ ശുദ്ധീകരിക്കപ്പെട്ട്, പാപമോചനം പ്രാപിച്ച് നിത്യസമാധാനം അനുഭവിക്കട്ടെ. ഓ, ദൈവമേ, വിശുദ്ധരായ ആത്മാക്കളെ എല്ലാ പാപബന്ധനങ്ങളിൽനിന്നും മോചിപ്പിക്കണമേ. അങ്ങനെ അവർ അങ്ങയുടെ സ്വർഗ്ഗീയമക്കളായി നിത്യാനന്ദം അനുഭവിക്കാൻ ഇടയാകട്ടെ. ഈ നൊവേന വഴി ഞാൻ യാചിക്കുന്ന അനുഗ്രഹം അങ്ങയുടെ ഉപരിമഹത്വത്തിനും ആത്മാക്കളുടെ രക്ഷയ്ക്കും വേണ്ടി നൽകുമാറാകണമേ, ആമ്മേൻ"
      }
  ],

  vanakkamaasam:[
      {
          topic : "മരണത്തിനു ശേഷം മൂന്നു സ്ഥലങ്ങളുണ്ട്.",
          advice : "മനുഷ്യരെല്ലാവരും മരിക്കുമെന്നത് നിശ്ചയം. ഓരോരുത്തരും ഒരു തവണ മാത്രമല്ലാതെ രണ്ടു മൂന്നു പ്രാവശ്യം മരിക്കുന്നതല്ല. മരണത്തിന്റെ ശേഷം വിധി നടക്കുമെന്നുള്ളത് അനിഷേധ്യമായ സത്യമാകയാൽ ഈ വിധിയിൽ നിന്നൊഴിഞ്ഞു കൊള്ളുന്നതിന് വഴികാണുകയില്ല. പരമനീതിയായ ദൈവം സൽകൃത്യ ദുഷ്കൃത്യങ്ങൾക്കനുസരിച്ച് ഓരോരുത്തർക്കും സമ്മാനമെങ്കിലും ശിക്ഷയെങ്കിലും കല്പിക്കുമെന്നുള്ളതും സന്ദേഹമില്ലാത്ത കാര്യമാകുന്നു. ചില പുണ്യാത്മാക്കൾ പൂർണ്ണ പരിശുദ്ധരായി ദൈവേഷ്ടത്തിൽ മരണം പ്രാപിച്ച് വിഘ്നമൊന്നും കൂടാതെ ഉടനെ അളവി ല്ലാത്ത നിത്യാനന്ദഭാഗ്യം നിറഞ്ഞ സ്വർഗ്ഗത്തിൽ എന്നന്നേയ്ക്കും വാഴുന്ന തിനു പോകുന്നു. ദൈവേഷ്ടപ്രസാദമില്ലാതെയും മാനസാന്തരപ്പെ ടാതെയും ചാവുദോഷത്തോടുകൂടെ മരിക്കുന്ന പാപികൾ നിത്യനരകത്തിൽ തള്ളപ്പെട്ട് കെടാത്ത തീയിൽ ദഹിക്കാത്ത കട്ട പോലെ വെന്ത്, വാക്കിലും ബുദ്ധിയിലുമടങ്ങാത്ത വേദനകൾ നിത്യമായി അനുഭവിക്കാൻ ഇടയാകുകയും ചെയ്യും. ഇങ്ങനെ എന്നെന്നേയ്ക്കും നില നിൽക്കുന്ന സ്വർഗ്ഗമെന്നും നരകമെന്നും രണ്ടു സ്ഥലങ്ങളുണ്ട്. അനവധി ജനങ്ങൾ നരകത്തിനർഹമായ ചാവു ദോഷമില്ലാതെ മരിക്കുന്നുണ്ട്. എങ്കിലും അവർക്ക് അല്പമായ പാപങ്ങൾ ഉണ്ടായിരിക്കകൊണ്ടും വെറുക്കപ്പെട്ട പാപങ്ങൾക്കു ശരിയായ പരിഹാരം അവർ ചെയ്യാതിരുന്നതുകൊണ്ടും അത് പാപത്തിന്റെയെങ്കിലും യാതൊരുവക കറയുമില്ലാത്ത പൂർണ്ണപരിശുദ്ധരായ ആത്മാക്കളുടെ രാജ്യമായ സ്വർഗ്ഗത്തിൽ ഉടനെ പ്രവേശിക്കാൻ യോഗ്യരല്ലാത്തതിനാൽ ഒരു മദ്ധ്യസ്ഥലത്തിലേക്കാണ് അവരുടെ യാത്ര. ഈ സ്ഥലത്തിൽ അല്പപാപങ്ങൾക്കും അവയുടെ പരിഹാരക്കടത്തിനും വേണ്ടി ശിക്ഷ അനുഭവിച്ച് അവർ ദൈവനീതിക്കു ശരിയായ ഉത്തരവാദം ചെയ്യണം. ഇങ്ങനെ പൂർണ്ണമായ പരിഹാരക്രിയയുടെ ശേഷം ഈ ആത്മാക്കൾ മോക്ഷാനന്ദഭാഗ്യം പ്രാപിച്ച് മറ്റു മോക്ഷവാസികളോടുകൂടെ എന്നന്നേയ്ക്കും വാഴുമെന്നുള്ളത് പരമസത്യമാകുന്നു. മേൽപ്പറഞ്ഞ ആത്മാക്കൾ ശുദ്ധീകരിക്കപ്പെടുന്ന സ്ഥലമത്തെ ശുദ്ധീകരണസ്ഥലമെന്നു പറയുന്നത്. മരിച്ചവരുടെ ആത്മാക്കൾക്ക് ഇങ്ങനെ മൂന്നു സ്ഥലങ്ങളുണ്ടെന്നു സത്യതിരുസഭ പഠിപ്പിച്ചുകൊണ്ടു വരുന്നത് യുക്തിക്കു സവിശേഷം യോജിക്കുകയും ചെയ്യുന്നു. കഠിനപാപങ്ങൾക്കു നരകവും പൂർണ്ണ പരിശുദ്ധിയുള്ള ആത്മാക്കൾക്കു മോക്ഷവും, മരിച്ചശേഷം ഉത്തരിപ്പു കടമുള്ള ആത്മാവുകൾക്ക് ശുദ്ധീകരണസ്ഥലവും ഇങ്ങനെ മൂന്നു സ്ഥലങ്ങളുണ്ടെന്നു വിശ്വസിപ്പാൻ നാം കടപ്പെട്ടിരിക്കുന്നു. നിത്യനരകത്തിൽ നിത്യശിക്ഷ അനുഭവിക്കുന്നവർക്കു മനുഷ്യർ മൂലം അല്പമെങ്കിലും തണുപ്പും സഹായവും നിശ്ചയമായും ഉണ്ടാകയില്ല. നിത്യാനുഗ്രഹത്താൽ വാഴുന്ന മോക്ഷവാസികളെ പുകഴ്ത്തി സ്തുതിച്ച് അവർ നമുക്കുവേണ്ടി സർവ്വേശ്വരനോടു പ്രാർത്ഥിപ്പാൻ തക്കവണ്ണം അവരുടെ മാദ്ധ്യസ്ഥം അപേക്ഷിക്കേണ്ടതാകുന്നു. ശുദ്ധീകരണ സ്ഥലത്തിൽ വേദനിക്കപ്പെടുന്ന ആത്മാക്കളുടെ പീഡകളെ നമ്മുടെ നോമ്പ്, ജപം, ദാനധർമ്മം ഇവയാലും തിരുസഭ യുടെ അപേക്ഷയുടെയും ദണ്ഡവിമേചനങ്ങളു ടെയും ഫലങ്ങളാലും, വിശേഷാൽ കുർബാനയാലും കുറക്കാൻ കഴിയുമെന്നുള്ളത് വേദസത്യമാണ്. ക്രിസ്ത്യാനികളെ ! മോക്ഷം, നരകം, ശുദ്ധീക രണ സ്ഥലം എന്ന ഈ മൂന്നു സ്ഥലങ്ങളെ കൂടെ കൂടെ വിചാരിച്ചു ധ്യാനിച്ചാൽ അനേകം ആത്മീയ പ്രയോജനങ്ങൾ ലഭിക്കാവുന്നതുകൊണ്ട് ഇവയെ ഒരിക്കലും വിസ്മരിച്ചു കളയരുത്. നരകത്തേയും അതിലുള്ള കെടാത്ത തീയേയും നിത്യമായി അനുഭവിക്കേണ്ടുന്ന വേദനകളെയും നരകത്തിന്റെ നിത്യത്വത്തേയും ഗാഢമായി ധ്യാനിച്ചാൽ ഭയപ്പെടാതെയും ഇവയ്ക്കു കാരണമായിരിക്കുന്ന ചാവു ദോഷത്തിൻമേൽ വെറുപ്പു തോന്നാതിരിപ്പാൻ കഴിയുമോ ? മോക്ഷം എല്ലാവക നന്മയും ഭാഗ്യവും നിറഞ്ഞ സ്ഥലമെന്നും ഈ മഹാഭാഗ്യം ഒരിക്കലും അവസാനിക്കുന്നതല്ലായെന്നും, മനസ്സുണ്ടെങ്കിൽ അതിനെ സംശയം കൂടാതെ പ്രാപിക്കാമെന്നും അതിൽ തങ്ങൾക്കു സിംഹാസനം സ്ഥാപി ച്ചിരിക്കുമെന്നും നന്നായിട്ടു വിചാരിച്ചു സ്ഥിരമായി വിശ്വസിച്ച് കൂടെക്കൂടെ ധ്യാനിക്കുന്നവർ എങ്ങനെ അതിനെ ആഗ്രഹിക്കാതിരിക്കും, അതിൻവണ്ണം തന്നെ ശുദ്ധീകരണ സ്ഥലത്തെപ്പറ്റി ധ്യാനിക്കുന്നവനും അനേകം നന്മകൾ സിദ്ധിക്കുന്നതാകുന്നു. അവിടെവച്ചു നേരിടുവാൻ പോകുന്ന വേദനകളിൽ നിന്നും ഒഴിവാകാൻ വേണ്ടി, തന്നാൽ കഴിയുംവണ്ണമൊക്കെയും അല്പ്പപാപങ്ങളിൽ പോലും ഉൾപ്പെടാതെയിരിക്കാൻ അവർ ശ്രമിക്കുന്നതാണ്. താൻ ചെയ്തുപോയ ചാവുദോഷത്തിന് കുമ്പസാരം വഴിയായി മോചനം കൈക്കൊണ്ടിരുന്നാലും അതിനു പരിഹാരമായി തപഃക്രിയകളെ അനുഷ്ഠിച്ചവരും മാത്രമല്ല, ശുദ്ധീകരണസ്ഥലത്തിൽ കിടക്കുന്ന ആത്മാക്കൾക്ക് സഹായവും രക്ഷയും കിട്ടുന്നതിനു വേണ്ടി ജപം, ദാനധർമ്മം മുതലായ സൽക്കർമ്മങ്ങളിൽ തല്പരനും തിരുസഭയുടെ നിക്ഷേപങ്ങളെ പ്രാപിക്കുക, കുർബാന കാണുക, ചൊല്ലിക്കുക, മുതലായ കൃത്യങ്ങളിൽ ഉത്സുകനും ആയിരിക്കും. ആകയാൽ ഈ മൂന്നു സ്ഥലങ്ങളെക്കുറിച്ചും കൂടെക്കൂടെ ധ്യാനിക്കുന്നത് ഉത്ത മമാകുന്നു.",
          prayer : "നിത്യപിതാവായ സർവ്വേശ്വരാ ! അങ്ങേപ്പക്കൽ വാഴുന്ന സകലമോക്ഷവാസികളെയും വണങ്ങി പുകഴ്ത്തി സ്തുതിക്കുന്ന ഞങ്ങൾക്ക് അവരുടെ സഹായമുണ്ടാകുവാൻ കൃപചെയ്തരുളണമേ. ഞങ്ങൾക്കു സാക്ഷാലുള്ള സമാധാനം തരേണമേ. അങ്ങേ തിരുസഭ നേരിടുന്ന എല്ലാ പ്രയാസങ്ങളെയും നീക്കേണമേ. അങ്ങേ ശുശ്രൂഷയിൽ ഞങ്ങളെയും സകല ക്രസ്ത്യാനികളെയും സ്ഥിരപ്പെടുത്തണമേ. ഞങ്ങളുടെ ഉപകാരികൾക്കു സ്വർഗ്ഗീയ നന്മകളും മരിച്ച സകല വിശ്വാസികളു ടെയും ആത്മാക്കൾക്കു നിത്യ സമാധാനവും കൊടുത്തരുളേണമെ എന്ന് അങ്ങേപ്പക്കൽ ഞങ്ങൾ പ്രാർത്ഥിക്കുന്നു. ആമ്മേൻ.",
          sukrithajapam:"ഈശോയുടെ പരിശുദ്ധ ഹൃദയമേ ശുദ്ധീകരാത്മാക്കളുടെമേൽ കരുണയായിരിക്കേണമേ ",
          salkriya:"ഈ മാസം ശുദ്ധീകരാത്മാക്കളെ സഹായിക്കാൻ തന്നാൽ കഴിയുന്നതെല്ലാം ചെയ്യുമെന്ന് പ്രതിജ്ഞ ചെയ്യുക"
      },
      {
          topic : "ശുദ്ധീകരണ സ്ഥലമുണ്ടെന്നുള്ളത് സർവ്വസമ്മതമായ സത്യമാകുന്നു",
          advice : "മാനസാന്തരപ്പെടാത്ത വലിയപാപികൾക്കുള്ള നിത്യനരകവും പൂർണ്ണ പരിശുദ്ധൻമാർക്കു സന്നദ്ധമാക്കിയിരിക്കുന്ന മോക്ഷവും കൂടാതെ പ്രായശ്ചിത്തക്കടം തീർക്കേണ്ട ആത്മാക്കൾക്ക് മറ്റൊരു മദ്ധ്യസ്ഥലവുമുണ്ടെന്നുള്ളതു എല്ലാവരും ഒരു പോലെ സമ്മതിച്ചു വിശ്വസിച്ചു വരുന്ന സത്യമാകുന്നു. ഈ സ്ഥലത്തിൽ പ്രായശ്ചിത്തക്കടം നിമിത്തം കിടക്കുന്ന ആത്മാക്കൾ അത്യധികമായ വേദനകൾ അനുഭവിക്കുന്നുണ്ട്. മനുഷ്യർ അവരെക്കുറിച്ചു ചെയ്യുന്ന ജപതപാദാനകർമ്മങ്ങളാലും സമർപ്പിക്കുന്ന പൂജകളാലും ഈ വേദന അമർന്നു കുറയുമെന്നറിഞ്ഞ് ഇവ മഹാ ആശയോടു കൂടെ അവർ നിറവേറ്റിക്കൊണ്ടും വരുന്നു. ഈശോ ഈ ലോകത്തെ വീണ്ടു രക്ഷിപ്പാൻ വേണ്ടി വരുന്നതിനു മുമ്പുണ്ടായിരുന്ന കീർത്തിപ്പെട്ട ഏഷ്യക്കാരും, പേർഷ്യക്കാരും, ഈജിപ്തുകാരും, ഗ്രീക്കുകാരും റോമാക്കാരും മരിച്ചവരെക്കുറിച്ച് അനേക കർമ്മങ്ങളും, ജപങ്ങളും, ബലികളും നടത്തി വന്നിരുന്നുവെന്നു അവരുടെ ചരിത്രങ്ങളിൽ നിന്നറിയുന്നു. പൂർവ്വകാലം മുതൽ ബിംബാരാധനക്കാരായിരിക്കുന്ന ചീന ദേശക്കാർ മരിച്ച തങ്ങളുടെ പൂർവ്വൻമാരെക്കുറിച്ച് വിശേഷ ഭയഭക്തികളോടുകൂടെ ചില തിരുനാളുകൾ കൊണ്ടാടി പലവട്ടം ബലികർമ്മങ്ങൾ നടത്തുന്നുണ്ടെന്നും കാണുന്നു. ഇൻഡ്യാരാജ്യത്തിലുള്ള ഹിന്ദുക്കൾ മരിച്ചവരുടെ ഈ ആത്മാക്കളെക്കുറിച്ചും ഓരോ കർമ്മങ്ങളും ദീക്ഷ മുതലായ പലതരം വ്രതങ്ങളും അനുഷ്ഠിച്ചു വരുന്നതു നാമും അറിഞ്ഞിട്ടുള്ളതാണല്ലോ. ഇവർ ഇങ്ങനെ പലവിധ കർമ്മങ്ങളും അനുഷ്ഠിക്കുന്നതു മരിച്ചവരുടെ ആത്മാക്കൾ സന്തോഷാവസ്ഥ യിൽ എത്തുവാൻ വേണ്ടിയുള്ളവയാണെന്നുള്ളത് സ്പഷ്ടമാണ്. ഈശോമിശിഹായുടെ വരവിനു മുൻപുതന്നെ സത്യദൈവത്തെ അറിഞ്ഞ് ആരാധിച്ചു വന്ന യൂദൻമാർ, മരിച്ചവരുടെ ആത്മാക്കൾ തങ്ങളുടെ കുറ്റങ്ങളിൽ നിന്ന് മോചിതരായി മോക്ഷാനന്ദ ഭാഗ്യം പ്രാപിപ്പാൻ തക്കവണ്ണം ജപം, തപസ്സ്, ദാനം, പൂജ ആദിയായവ ചെയ്തു വന്നുവെന്നു വേദപുസ്തകത്തിൽ നിന്നു ഗ്രഹിക്കാവുന്നതാണ്. മഹാ വീരശൂരനായ യൂദാമക്ക്ബായുടെ കാലങ്ങ ളിൽ ചില സേനകൾ സത്യവേദത്തെക്കുറിച്ച് ചെയ്ത യുദ്ധത്തിൽ അപായപ്പെട്ടു മരിച്ചു. അവരുടെ ശരീരങ്ങൾ മഹാപൂജ്യതയോടെ സംസ്ക്കരിച്ച്, അവരുടെ ആത്മാക്കൾക്കുവേണ്ടി എല്ലാവരും പ്രാർത്ഥിച്ചു വന്നതു കൂടാതെ പടത്തലവനായ യൂദാമക്ക്ബാ ജനങ്ങളിൽ നിന്നും വളരെ പണം ശേഖരിച്ചു. പന്തീരായിരം വെള്ളി നാണയങ്ങൾ ഓർശം മഹാ നഗരിയിലുള്ള ദേവാലയത്തിൽ കൊടുത്തയച്ച് മരിച്ചവരുടെ പാപങ്ങൾക്കുവേണ്ടി പൂജകൾ ചെയ്യിക്കയുണ്ടായി . മക്ക്ബായ രണ്ടാം പുസ്തകത്തിൽ പറഞ്ഞിരിക്കുന്ന ഈ സംഭവത്തിൽനിന്ന് മരിച്ചവരുടെ പാപപരിഹാരത്തിന് നമ്മാൽ പാടുള്ള സൽകൃത്യങ്ങൾ ചെയ്യുന്നതു വളരെ പ്രയോജനകരമാണെന്നു തെളിയുന്നുണ്ടല്ലോ. ഈശോ മിശിഹായെ അവിശ്വസിക്കുന്നെങ്കിലും യൂദന്മാർ ഇക്കാലത്തിൽക്കൂടെയും ശുദ്ധീകരണ സ്ഥലമുണ്ടെന്നു വിശ്വസിച്ച്, മരിച്ചവരുടെ ആത്മാക്കൾക്കുവേണ്ടി ചില കർമ്മങ്ങൾ നടത്തി വരുന്നുണ്ട്. മരിച്ചവരുടെ ആത്മാക്കൾ ശുദ്ധീകരണസ്ഥലത്തിൽ അനുഭവിക്കുന്ന വേദനകൾ കുറയുന്നതിനായിട്ട് ജപം, തപസ്സ്, ദാനം, ദിവ്യപൂജ മുതലായ സൽകൃത്യങ്ങളുടെ അനുഷ്ഠാനം തിരുസഭയുടെ ആരംഭം മുതൽക്കേ ഉള്ളതാകുന്നു. പിശാചിന്റെ പരീക്ഷകളാൽ അറിയാനോസ്സുകാരെന്നും, നെസ്തോറിയൻകാരെന്നും, ഗ്രീക്കുസഭക്കാരെന്നും, മൊസ്ക്കോബിത്തർ എന്നും പറയപ്പെടുന്ന പതിതർ കൂട്ടമായിട്ട് തിരുസഭയിൽ നിന്ന് പിരിഞ്ഞു പോയിട്ടുണ്ട്. അവരും മരിച്ചവർക്കുവേണ്ടി നമ്മെപ്പോലെ ജപങ്ങളും മറ്റും ചെയ്തുകൊണ്ടു വരുന്നു. ഇന്ത്യാരാജ്യത്തിലുള്ള മലയാളദേശത്തിൽ അനേകായിരം ജനങ്ങൾ യാക്കോബായ ശീശ്മയിൽ ഉൾപ്പെട്ടിട്ടുണ്ടല്ലോ. അവരുടെയിടയിലും മേല്പറഞ്ഞതുപോലെ നടന്നുവരുന്നുണ്ട്. ഇപ്പോൾ പറഞ്ഞ സംഗതികളെ കേട്ട് ക്രിസ്ത്യാനികളെ സകലജാതി ജനങ്ങളും എല്ലാക്കാലങ്ങളിലും എല്ലാദേശങ്ങളിലും വിശ്വസിച്ചനുസരിച്ചു വരുന്നതുപോലെ നരകവും മോക്ഷവുമല്ലാതെ മദ്ധ്യസ്ഥലമായ ശുദ്ധീകരണ സ്ഥലമുണ്ടെന്നും അതിൽ കഷ്ടപ്പെടുന്ന ആത്മാക്കൾക്ക് നിങ്ങളുടെ സൽക്രിയകളാൽ ആശ്വാസവും രക്ഷയും വരുത്തുവാൻ കഴിയുമെന്നും നിങ്ങളും വിശ്വസിക്കണം. 16-ാം നൂറ്റാണ്ടിൽ ഉണ്ടായ പ്രോട്ടസ്റ്റന്റു മതക്കാർ മാത്രമേ ഈ സത്യത്തെ അവിശ്വ സിക്കുന്നുള്ളൂ. അവരുടെ ഈ അബദ്ധബോധനത്തിൽ ഉൾപ്പെടാതിരിക്കാൻ പ്രത്യേകം സൂക്ഷി ക്കണം.",
          prayer : "സകല വിശ്വാസികളുടെയും സ്രഷ്ടാവും രക്ഷിതാവുമായ സർവ്വേശ്വരാ! മരിച്ച അങ്ങേ ദാസർക്കുവേണ്ടി ഭക്തിപൂർവ്വം ചെയ്യപ്പെടുന്ന അപേക്ഷയെ കൈക്കൊണ്ട്, അവർ എറ്റവും തീക്ഷ്ണമായി ഇച്ഛിക്കുന്ന പാപപരിഹാരം അവർക്കു നൽകിയരുളണമെന്നു ഞങ്ങൾ പ്രാർത്ഥിക്കുന്നു. സദാ ജീവിക്കുന്നവനായ സർവ്വേശ്വരാ കർത്താവേ! ഈ പ്രാർത്ഥനയെ ദയയോടുകൂടെ കേട്ടരുളേണമെ.",
          sukrithajapam:"മറിയത്തിന്റെ വിമലഹൃദയമേ ശുദ്ധീകരത്മാക്കൾക്കായി പ്രാത്ഥിക്കണേ ",
          salkriya:`ശുദ്ധീകരണസ്ഥലത്തുള്ള ആത്മാക്കൾക്കായി 5 തവണ<a class="btn malayalam text-info" href="" onclick="display(1)"> ആയിരം ആത്മാക്കളുടെ ജപം</a> ചൊല്ലി കാഴ്ചവയ്ക്കാം `
      },
      {
          topic : "ശുദ്ധീകരണ സ്ഥലമുണ്ടെന്നുള്ളത് സത്യവിശ്വാസമാകുന്നു",
          advice : `പഴയ നിയമത്തിൽ നിന്നും നമ്മുടെ ദിവ്യ രക്ഷിതാവരുളിച്ചെയ്ത വാക്യങ്ങളിൽ നിന്നും തന്റെ സ്ഥാനപതികളായിരിക്കുന്ന ശ്ലീഹന്മാരുടെ ലേഖനങ്ങളിൽ നിന്നും വേദപാരംഗതന്മാർ എല്ലാവരും ശുദ്ധീകരണസ്ഥലമുണ്ടെന്നു സ്പഷ്ടമായി കാണിച്ചിട്ടുണ്ട്. സത്യവേദത്തെ എല്ലായിടങ്ങളിലും അറിയിച്ച് സ്ഥാപിച്ച് ശ്ലീഹന്മാരുടെ കാലം മുതൽ ഈ നാൾവരേയ്ക്കും ശുദ്ധീകരണ സ്ഥലത്തിൽ കഷ്ടപ്പെടുന്ന ആത്മാക്കളെക്കുറിച്ചു ജപം, തപസ്സ്, ആദിയായ ധാർമ്മിക കൃത്യങ്ങളെയും ബലിപൂജകളെയും ചെയ്തുവരുന്ന പിതാവു പാരമ്പര്യമായി നടന്നുവരുന്നതു കൂടാതെ അതതു കാലങ്ങളിൽ ജീവിച്ചിരുന്ന വേദപാരംഗതന്മാരും ഗ്രന്ഥകർത്താക്കളും ദൈവിക ശാസ്ത്രികളും ഇതിനെ താല്പര്യത്തോടുകൂടെ നടത്തിവരണമെന്ന് ഉപദേശിച്ചിട്ടുണ്ട്. വിശുദ്ധ പത്രോസു ശ്ലീഹായുടെ ശിഷ്യനായിരുന്ന ശുദ്ധ ക്ലെമന്റു മാർപാപ്പ പ്രസിദ്ധപ്പെടുത്തിയ അപ്പസ്തോലിക കല്പനകളുടെ എട്ടാമദ്ധ്യായത്തിൽ “തമ്പുരാന്റെ സമാധാനത്തിൽ മരിച്ച നമ്മുടെ സഹോദരന്മാരുടെ ആത്മാക്കളുടെ പാപങ്ങളെ സർവ്വേശ്വരൻ കൃപചെയ്ത് പൊറുത്ത്, അവരെ മഹാപിതാവായ അബ്രാഹത്തിന്റെ മടിയായ മോക്ഷത്തിൽ ചേർത്തുകൊൾവാൻ തക്ക വണ്ണം നാം പ്രാർത്ഥിച്ചു കൊള്ളണം" എന്നു പറഞ്ഞിരിക്കുന്നു. അവരെക്കുറിച്ച് ഒരു വിശിഷ്ട ജപവും അദ്ദേഹം എഴുതി പ്രസിദ്ധീകരിച്ചിട്ടുണ്ട്. ക്രിസ്ത്വാബ്ദം നൂറ്റമ്പതിൽ ജീവിച്ചിരുന്ന തെർത്തുല്യൻ എന്ന പണ്ഡിതൻ ഒരു വിധവ തന്റെ ഭർത്താവിന്റെ ആത്മാവിനുവേണ്ടി പ്രാർത്ഥിക്കാനുള്ള താല്പര്യം കൂടാതെ വേറെ വിവാഹം ചെയ്യുന്നതു നന്നല്ലെന്നു എഴുതിയിരിക്കുന്നു. 180-ാ മാണ്ടിൽ മഹാപണ്ഠിതനായ ഒരിജൻ ഈ ലോകത്തിൽ യുദ്ധജീവിതം കഴിച്ചിട്ടു പരലോകത്തിലേയ്ക്കു പോകുന്നവന് പരിഹാരക്കടമുള്ളതുകൊണ്ട് മരിച്ചവരെക്കുറിച്ച് പ്രാർത്ഥിക്കുന്നത് നമ്മുടെ കടമയും പ്രയോജനമുള്ള ഒരു പതിവുമാകുന്നു എന്ന് എഴുതിയിരിക്കുന്നു. 350-ാ മാണ്ടിൽ അർമേനിയാ ദേശത്തിൽ സത്യ വേദദീപം പോലെ ശോഭിച്ചിരുന്ന മഹാപണ്ഡിതനായ വിശുദ്ധ അപ്രേം ആസന്ന മരണനായിരിക്കെ തന്റെ അടുക്കൽ നിന്നിരുന്ന ശിഷ്യരെ നോക്കിക്കൊണ്ട്, “എന്റെ പ്രിയ മക്കളേ! മരിക്കാൻ പോകുന്ന നിങ്ങളുടെ പിതാവായ എനിക്കു നിങ്ങൾ അന്തിമോപചാരം ചെയ്യുന്നതിനു വരുവിൻ എന്റെ ശരീരത്തിനു പരിമളദ്രവ്യങ്ങൾ നിങ്ങൾ കൊടുക്കേണ്ട. എന്നാൽ ഞാൻ സർവ്വശ്വരന്റെ പക്കൽ കൃപ പ്രാപിപ്പാൻ തക്കവണ്ണം ദൈവസ്തോത്രങ്ങൾ പാടി കണ്ണുനീർ ചൊരിഞ്ഞ് എന്റെ ആത്മാവിനെക്കുറിച്ച് നിങ്ങൾ പ്രാർത്ഥിച്ചു കൊള്ളണം. ഇനിമേൽ ദേവാലയത്തിൽ നിങ്ങൾ കൂടുമ്പോഴൊക്കെയും എന്നെ മറക്കാതെ എനിക്കു വേണ്ടി പ്രാർത്ഥിപ്പാറാകണം” എന്നു പറഞ്ഞു. വിശുദ്ധ അബ്രോസിസ് “എനിക്ക് മകനും യജമാനനുമായ തെയോദേസിയോസ് രാജാവിന്റെ ആത്മാവിനെ മോക്ഷത്തിൽ പ്രവേശിപ്പിക്കും വരെയും, തന്റെ ജപങ്ങളേയും കരച്ചിലുകളെയും തപഃക്രിയകളെയും ഞാൻ നിറുത്തുകയില്ല" എന്ന് പറയുകയുണ്ടായി. തന്റെ മാതാവായ വിശുദ്ധ മോനിക്ക മരിച്ചതിന്റെശേഷം വിശുദ്ധ ആഗസ്തീനോസ് എഴുതിയ വാക്യം ഇങ്ങനെയാണ്. “എന്റെ മഹിമയും ജീവനുമായിരിക്കുന്ന സർവ്വേശ്വരാ! ഇപ്പോൾ എന്റെ അമ്മയുടെ പുണ്യങ്ങളെ അങ്ങേപ്പക്കൽ വിസ്തരിച്ചു പറയാതെ എന്റെ അമ്മയുടെ പാപപരിഹാരത്തിനായി ഞാൻ പ്രാർത്ഥിക്കുന്നു. കർത്താവേ! ഈ ദാസിയെ അനുഗ്രഹിക്കണമേ. ഈ ആളിനെ കഠിനവിധി ചെയ്യരുതേ. അങ്ങേ ഈ ദാസി മരണസമയത്ത് സ്വന്തം ശരീരത്തെ നിരൂപിച്ചുമില്ല. അതിനെ ഘോഷമായ വിധത്തിൽ സംസ്ക്കരിക്കണമെന്ന് എന്നോടൊട്ടപേക്ഷിച്ചതുമില്ല എന്ന് നിനച്ചരുളേണമെ. ദിവ്യപൂജ പാപപരിഹാരാർത്ഥവും അർപ്പിക്കപ്പെടുന്നുണ്ടെന്നറിഞ്ഞ് ആ ദിവ്യപൂജയിൽ തന്നെ ഓർമ്മിക്കണമെന്നു മാത്രമേ എന്നോടാവശ്യപ്പെട്ടിട്ടുള്ളൂ. അതിനാൽ എന്റെ കർത്താവായ സർവ്വേശ്വരാ! ഇപ്പോൾ ഞാനെഴുതിയ ഇവയെ വായിക്കാൻ പോകുന്ന അങ്ങേ ശുശ്രൂഷികളും എന്റെ സഹോദരന്മാരുമായ സകലരും അങ്ങേ ദാസിയായ മോനിക്കായെ സ്മരിച്ച്, അവളുടെ ആത്മാവിനുവേണ്ടി പ്രാർത്ഥിക്കുവാൻ തക്കവണ്ണം കൃപചെയ്തരുളണമെ.” കൂടാതെ ഈ മഹാ വിശുദ്ധൻ മരിച്ചവരെക്കുറിച്ചു നടത്തിവരേണ്ട കടമകളെക്കുറിച്ചു ഒരു വിശിഷ്ടമായ പുസ്തകവും എഴുതിയിട്ടുണ്ട്. ഏതൽസംബന്ധമായി വിശുദ്ധ ക്രിസോസ്തോമ്മാസ്, വിശുദ്ധ ഈറാനിമോസ്, വിശുദ്ധ ബസീലിയോസ്, വിശുദ്ധ കുരില്ലോസ്, വിശുദ്ധ ഗ്രിഗോറിയോസ് മുതലായ വേദപരാംഗതന്മാർ എഴുതിയവയൊക്കെയും വിസ്താരഭയംകൊണ്ട് ഉപേക്ഷിക്കുന്നു. ഇപ്പോൾ പറഞ്ഞതുപോലെ, ശ്ലീഹന്മാരുടെ കാലം തുടങ്ങി ഈ നാൾവരെയും ഉണ്ടായിട്ടുള്ള വേദശാസ്ത്രികൾ എല്ലാവരും മരിച്ചവരെക്കുറിച്ചു പ്രാർത്ഥിക്കുന്നത്. തിരുസഭയിലെ പതിവാണ് എന്ന് എഴുതിയിരിക്കുന്നു. അതുകൊണ്ട് ശ്ലീഹന്മാരുടെ ഉപദേശത്തിൽ നിന്നാണ് ഇതിന്റെ ഉത്ഭവമെന്ന് സിദ്ധിക്കുന്നുണ്ടല്ലോ. എന്നാൽ ശുദ്ധീക രണസ്ഥലമില്ലെങ്കിൽ മരിച്ചവരെക്കുറിച്ചു ചെയ്യുന്ന അപേക്ഷകളും ധാർമ്മിക കൃത്യങ്ങളും അനാവശ്യം തന്നെ. കത്തോലിക്കാ സഭ അനാവശ്യമായ ഒരു സംഗതിയെ ഇത്ര നിഷ്ക്കർഷമായി പഠിപ്പിക്കാൻ പാടില്ലാത്തതുകൊണ്ട് മരിച്ചവർക്കു വേണ്ടി പ്രാർത്ഥിക്കുന്നതും മറ്റും ശ്ലീഹന്മാരുടെ പ്രബോധനത്തിൽ നിന്നുവന്ന തിരുസഭയിലെ ഒരു പതിവായിരിക്കുന്നു എന്നു തെളിയുന്നു. തെറ്റുവാൻ പാടില്ലാത്ത തിരുസഭയുടെ വിശ്വാസം ഈ വിഷയത്തിൽ ഏതുപ്രകാരമെന്നു നന്നായിട്ടറിവാൻ വേണ്ടി ഫ്ളോറൻസ് പട്ടണത്തിൽ കൂടിയ പൊതുസ്വനഹദോസിൽ വച്ച് പ്രസിദ്ധീകൃതമായ നിശ്ചയമാണ് താഴെക്കാണുന്നത്. “പാപികൾ യഥാർത്ഥമായി മനസ്താപപ്പെട്ടു തപ്രക്രിയകളാൽ തങ്ങളുടെ പാപങ്ങൾക്ക് ഈ ലോകത്തിൽവെച്ചു പരിഹാരം ചെയ്യുന്നതിനു മുൻപ് മരിച്ചാൽ അവരുടെ ആത്മാക്കൾ ശുദ്ധീകരണ സ്ഥലത്തിലുള്ള വേദനകളാൽ ശുദ്ധീകരിക്കപ്പെടും. അപ്പോൾ ഈ ആത്മാക്കൾ ലോകത്തിൽ ജീവിച്ചി രിക്കുന്ന ക്രിസ്ത്യാനികളുടെ അപേക്ഷകളാൽ മോചിതരാകുവാൻ കഴിയുമെന്നുള്ളതു സത്യമാകയാൽ അവരെക്കുറിച്ചു ദിവ്യപൂജ അർപ്പിക്കുന്നതും പ്രാർത്ഥിക്കുന്നതും മറ്റ് സൽകൃത്യങ്ങൾ ചെയ്യുന്നതും തിരുസഭയുടെ കീഴ്മര്യാദയും കല്പനയും മൂലമാകുന്നു." 1545-ാ മാണ്ടിൽ തന്ത് എന്ന നഗരിയിൽ നടന്നതും “തെന്തോസ് സൂനഹദോസ്” എന്നു ലോക പ്രസിദ്ധവുമായ സംഘത്തിൽ കൂടിയ എല്ലാമെത്രാന്മാരും ശുദ്ധീകരണസ്ഥലമുണ്ടെന്നും അതിൽ ഉൾപ്പെട്ടിരിക്കുന്ന ആത്മാക്കൾ ദിവ്യപൂജയാലും വിശ്വാസികളുടെ പ്രാർത്ഥനകളാലും ആശ്വാസവും സഹായവും അനുഭവിക്കുമെന്നും പൂർണ്ണമായി ഉറപ്പിച്ചിരിക്കുന്നു. ഈ പരമസത്യം പട്ടക്കാരെല്ലാവരും തങ്ങളുടെ ആജ്ഞയിലുള്ള വിശ്വാസികളെ കുറവൊന്നും കൂടാതെ അറിയിക്കുകയും അവരും അതിനെ ശരിയായി സമ്മതിക്കുകയും ചെയ്യണമെന്നു കല്പിച്ചിട്ടുണ്ട്. ക്രിസ്ത്യാനികളേ! ഇപ്പോൾ വിസ്തരിച്ചു കാണിച്ച ഉദാഹരണങ്ങളാൽ നിങ്ങൾ വിശ്വാസത്തിൽ പൂർവ്വാധികം സ്ഥിരമായി നിൽക്കുകയും നിങ്ങളുടെ ജപം, തപസ്സ് ആദിയായ സൽക്കർമ്മങ്ങളാൽ ശുദ്ധീകരണസ്ഥലത്തിലുള്ള ആത്മാക്കളെ, ആശ്വസിപ്പിച്ചു സഹായിക്കയും ചെയ്യേണ്ട താകുന്നു.`,
          prayer : "നിത്യപിതാവേ! മാതാപിതാക്കൾ, ബന്ധു ക്കൾ, സ്നേഹിതന്മാർ, ഉപകാരികൾ മുതലായവരെ തക്കപോലെ സ്നേഹിച്ച് അവർക്കുവേണ്ട നന്മകൾ ചെയ്യണമെന്ന് അങ്ങ് കല്പിച്ചരുളിയിരിക്കുന്നുവല്ലോ. അതുകൊണ്ട് ഞങ്ങൾക്കു ജന്മം നൽകി ദയയോടുകൂടെ വളർത്തി പരിപാലിച്ചു വന്നവരും, പല ഉപകാരങ്ങൾ ഞങ്ങൾക്കു ചെയ്തവരും, ഞങ്ങളുടെ സംബന്ധക്കാർ, ബന്ധുക്കൾ, സ്നേഹിതന്മാർ മുതലായവരും വേദന നീങ്ങി നിത്യമായി അങ്ങനെ സന്തോഷപൂർവ്വം ദർശിച്ചു കൊണ്ടിരിക്കാൻ കൃപചെയ്തരുളണമെന്നു ഞങ്ങൾ പ്രാർത്ഥിക്കുന്നു.",
          sukrithajapam:"ഓ ഈശോയുടെ തിരുവിലാവിൽനിന്ന് ഒഴുകിയിറങ്ങിയ തിരുരക്തമേ ശുദ്ധീകരാത്മാക്കളെ കഴുകി വിശുദ്ധീകരിക്കണമേ. ",
          salkriya:"ആയിരം ആത്മാക്കളുടെ ജപം 5 തവണ ചൊല്ലി കഴ്ചവയ്ക്കുക"
      },
      {
          topic : "Topic of day 4",
          advice : "advice of day 4",
          prayer : "prayer of day 4",
          sukrithajapam:"sukruthajapam of day 4",
          salkriya:"Today's salkriya"
      },
      {
          topic : "Topic of day 5",
          advice : "advice of day 5",
          prayer : "prayer of day 5",
          sukrithajapam:"sukruthajapam of day 5",
          salkriya:"Today's salkriya"
      },
      {
          topic : "Topic of day 6",
          advice : "advice of day 6",
          prayer : "prayer of day 6",
          sukrithajapam:"sukruthajapam of day 6",
          salkriya:"Today's salkriya"
      },
      {
          topic : "Topic of day 7",
          advice : "advice of day 7",
          prayer : "prayer of day 7",
          sukrithajapam:"sukruthajapam of day 7",
          salkriya:"Today's salkriya"
      },
      {
          topic : "Topic of day 8",
          advice : "advice of day 8",
          prayer : "prayer of day 8",
          sukrithajapam:"sukruthajapam of day 8",
          salkriya:"Today's salkriya"
      },
      {
          topic : "Topic of day 9",
          advice : "advice of day 9",
          prayer : "prayer of day 9",
          sukrithajapam:"sukruthajapam of day 9",
          salkriya:"Today's salkriya"
      },
      {
          topic : "Topic of day 10",
          advice : "advice of day 10",
          prayer : "prayer of day 10",
          sukrithajapam:"sukruthajapam of day 10",
          salkriya:"Today's salkriya"
      },
      {
          topic : "Topic of day 11",
          advice : "advice of day 11",
          prayer : "prayer of day 11",
          sukrithajapam:"sukruthajapam of day 11",
          salkriya:"Today's salkriya"
      },
      {
          topic : "Topic of day 12",
          advice : "advice of day 12",
          prayer : "prayer of day 12",
          sukrithajapam:"sukruthajapam of day 12",
          salkriya:"Today's salkriya"
      },
      {
          topic : "Topic of day 13",
          advice : "advice of day 13",
          prayer : "prayer of day 13",
          sukrithajapam:"sukruthajapam of day 13",
          salkriya:"Today's salkriya"
      },
      {
          topic : "Topic of day 14",
          advice : "advice of day 14",
          prayer : "prayer of day 14",
          sukrithajapam:"sukruthajapam of day 14",
          salkriya:"Today's salkriya"
      },
      {
          topic : "Topic of day 15",
          advice : "advice of day 15",
          prayer : "prayer of day 15",
          sukrithajapam:"sukruthajapam of day 15",
          salkriya:"Today's salkriya"
      },
      {
          topic : "Topic of day 16",
          advice : "advice of day 16",
          prayer : "prayer of day 16",
          sukrithajapam:"sukruthajapam of day 16",
          salkriya:"Today's salkriya"
      },
      {
          topic : "Topic of day 17",
          advice : "advice of day 17",
          prayer : "prayer of day 17",
          sukrithajapam:"sukruthajapam of day 17",
          salkriya:"Today's salkriya"
      },
      {
          topic : "Topic of day 18",
          advice : "advice of day 18",
          prayer : "prayer of day 18",
          sukrithajapam:"sukruthajapam of day 18",
          salkriya:"Today's salkriya"
      },
      {
          topic : "Topic of day 19",
          advice : "advice of day 19",
          prayer : "prayer of day 19",
          sukrithajapam:"sukruthajapam of day 19",
          salkriya:"Today's salkriya"
      },
      {
          topic : "Topic of day 20",
          advice : "advice of day 20",
          prayer : "prayer of day 20",
          sukrithajapam:"sukruthajapam of day 20",
          salkriya:"Today's salkriya"
      },
      {
          topic : "Topic of day 21",
          advice : "advice of day 21",
          prayer : "prayer of day 21",
          sukrithajapam:"sukruthajapam of day 21",
          salkriya:"Today's salkriya"
      },
      {
          topic : "Topic of day 22",
          advice : "advice of day 22",
          prayer : "prayer of day 22",
          sukrithajapam:"sukruthajapam of day 22",
          salkriya:"Today's salkriya"
      },
      {
          topic : "Topic of day 23",
          advice : "advice of day 23",
          prayer : "prayer of day 23",
          sukrithajapam:"sukruthajapam of day 23",
          salkriya:"Today's salkriya"
      },
      {
          topic : "Topic of day 24",
          advice : "advice of day 24",
          prayer : "prayer of day 24",
          sukrithajapam:"sukruthajapam of day 24",
          salkriya:"Today's salkriya"
      },
      {
          topic : "Topic of day 25",
          advice : "advice of day 25",
          prayer : "prayer of day 25",
          sukrithajapam:"sukruthajapam of day 25",
          salkriya:"Today's salkriya"
      },
      {
          topic : "Topic of day 26",
          advice : "advice of day 26",
          prayer : "prayer of day 26",
          sukrithajapam:"sukruthajapam of day 26",
          salkriya:"Today's salkriya"
      },
      {
          topic : "Topic of day 27",
          advice : "advice of day 27",
          prayer : "prayer of day 27",
          sukrithajapam:"sukruthajapam of day 27",
          salkriya:"Today's salkriya"
      },
      {
          topic : "Topic of day 28",
          advice : "advice of day 28",
          prayer : "prayer of day 28",
          sukrithajapam:"sukruthajapam of day 28",
          salkriya:"Today's salkriya"
      },
      {
          topic : "Topic of day 29",
          advice : "advice of day 29",
          prayer : "prayer of day 29",
          sukrithajapam:"sukruthajapam of day 29",
          salkriya:"Today's salkriya"
      },
      {
          topic : "Topic of day 30",
          advice : "advice of day 30",
          prayer : "prayer of day 30",
          sukrithajapam:"sukruthajapam of day 30",
          salkriya:"Today's salkriya"
      }
  ]
};


var vanakkamaasamCommonEnding = "ലുത്തിനിയ ";

var contentDiv = document.getElementById("contentDiv");
var audio = document.getElementById("audio");

var Novena  = document.getElementById("novena");
var vanakkamaasam  = document.getElementById("vanakkamaasam");
var y = 0;

var novenaStartingCommon = `

    <p class="malayalam fw-500 text-wrap text-center h4">പ്രാരംഭപ്രാർത്ഥന</p>

    <p class="malayalam text-wrap text-left p">
    <span class="malayalam fw-500 text-wrap text-center p d-block py-3">അനുതാപപ്രകരണം</span>

    ഓ, പരിശുദ്ധാത്മാവേ! എന്റെ ആത്മാവിലേക്ക് എഴുന്നള്ളി വന്ന് ഞാൻ ചെയ്തുപോയ എല്ലാ പാപങ്ങളും കണ്ടെത്താനും അവയെക്കുറിച്ചോർത്ത് വലിയ എളിമയോടും പശ്ചാത്താപത്തോടും കൂടെ ദുഃഖിക്കാനും വരം തരണമേ. ഓ, എന്റെ ദൈവമേ! അങ്ങയുടെ തിരുമുൻപാകെയും സ്വർഗ്ഗവാസികൾ മുഴുവൻപേരുടെ മുൻപാകെയും ഞാൻ ആത്മാർത്ഥമായി ഏറ്റുപറയുന്നു, ചിന്തയാലും വാക്കാലും പ്രവൃത്തിയാലും അങ്ങേയ്ക്കെതിരായി ഞാൻ പാപം ചെയ്തുപോയി. എന്റെ പാപം മൂലം ഞാൻ ഈശോയുടെ കുരിശുമരണത്തിനു കാരണമായിത്തീർന്നു. എങ്കിലും അങ്ങ് എന്റെ ആത്മാവിനെ അവിടത്തെ പുത്രന്റെ രക്തത്തിൽ കഴുകി, എന്റെ പാപങ്ങൾ ക്ഷമിക്കുകയും അവിടത്തെ പ്രസാദവരത്തിന്റെ കല്യാണവസ്ത്രത്താൽ എന്നെ അലങ്കരിക്കുകയും ചെയ്തു. ധൂർത്തനായ എന്നെപ്പോലൊരു മകനെ കനിഞ്ഞനുഗ്രഹിച്ച അങ്ങേ കാരുണ്യാതിരേകം അനുഭവിച്ചുകൊണ്ട്, അനുതാപംകൊണ്ടും അതിരില്ലാത്ത നന്ദികൊണ്ടും നിറഞ്ഞ ഹൃദയത്തോടെ ഞാനിതാ അങ്ങേ തിരുമുമ്പിൽ അണയുന്നു. അങ്ങ് എന്നിലേക്കു ചൊരിഞ്ഞ എല്ലാ അനുഗ്രഹങ്ങൾക്കും ഞാൻ എന്തു പ്രത്യുപകാരം ചെയ്യും? കർത്താവേ, എന്റെ എല്ലാ പാപങ്ങളെക്കുറിച്ചും ഞാൻ ദുഃഖിക്കുന്നു. അങ്ങയെ സ്നേഹിക്കുന്നതിനാൽ മേലിൽ പാപം ചെയ്യില്ല എന്ന് ഞാൻ പ്രതിജ്ഞ ചെയ്യുന്നു. ആമ്മേൻ.

            
    <span class="malayalam fw-600 text-wrap text-center p d-block py-3">ദിവസവും ചൊല്ലേണ്ട പ്രാർത്ഥന</span>
    <span class="malayalam text-wrap text-left d-block py-3">
    ഓ, ദൈവമേ! അങ്ങയുടെ കാരുണ്യത്തിലാണല്ലോ മരിച്ചുപോയ ആത്മാക്കൾ ആശ്വാസം കണ്ടെത്തുന്നത്. അവിടുന്ന് അവരെ ശത്രുവാകുന്ന പിശാചിന്റെ കരങ്ങളിൽ ഏല്പിക്കുകയോ നിത്യമായി മറന്നുകളയുകയോ ഇല്ല. മറിച്ച് അവർ മാലാഖമാരാൽ സംവഹിക്ക പ്പെട്ട് സ്വർഗരാജ്യമായ നിത്യഭവനത്തിൽ എത്തിച്ചേരാൻ ഒരു നാൾ ഇടവരും എന്നതിൽ നിത്യാശ്വാസം കണ്ടെത്താൻ അനുഗ്രഹിക്കണമേ. അങ്ങ് ഈ ലോകത്തിൽനിന്ന് അങ്ങേപ്പക്കലേക്കു വിളിച്ചവർ, തങ്ങളുടെ സ്നേഹവും വിശ്വാസവും അങ്ങിൽ അർപ്പിച്ചിരിക്കയാൽ നിത്യനരകാഗ്നിയുടെ വേദനയിൽപ്പെടാതെ നിത്യസൗഭാഗ്യത്തിന്റെ സന്തോഷം സ്വന്തമാക്കാൻ ഇടയാകണമെന്നു ഞാൻ പ്രാർത്ഥിക്കുന്നു. ഓ ദൈവമേ! മരിച്ച ആത്മാക്കളോടു കരുണയായിരിക്കണമേ. അഗാധമായ കുഴിയിൽ നിന്നും സിംഹത്തിന്റെ വായിൽ നിന്നും രക്ഷിച്ച അവരെ നരകം വിഴുങ്ങാൻ അങ്ങ് അനുവദിക്കരുതേ. അങ്ങയുടെ സൈന്യത്തിന്റെ പതാകവാഹകനായ വിശുദ്ധ മിഖായേൽ, അബ്രാഹത്തിനും അവന്റെ സന്തതികൾക്കുമായി അങ്ങ് വാഗ്ദാനം ചെയ്ത ദിവ്യപ്രകാശത്തിലേക്ക് അവരെ നയിക്കട്ടെ. ആത്മാക്കൾക്കായി ഞാൻ അർപ്പിക്കുന്ന പ്രാർത്ഥനകളും സഹനങ്ങളും അങ്ങു കൈക്കൊണ്ട്, ഞാൻ നടത്തുന്ന ഈ നൊവേനയുടെ ഫലമായി അവർക്ക് മരണത്തിൽനിന്നു നിത്യജീവനിലേക്ക് പ്രവേശനം നൽകണമേ, ആമ്മേൻ.
    </span>   
    </p>

    <p class="malayalam text-wrap text-left">
    <span class="fw-600 p malayalam">ശുദ്ധീകരണസ്ഥലത്തെ ആത്മാക്കൾക്കുവേണ്ടി.</span> <br>
    (നന്മ നിറഞ്ഞ മറിയം. 3 പ്രാവശ്യം)
    </p>

    <p class="malayalam text-wrap text-left">
    <span class="fw-600 p malayalam">ഈ നൊവേനയിലൂടെ ലഭിക്കുന്ന അനുഗ്രഹങ്ങൾക്കായി... </span> <br>
    (ത്രിത്വസ്തുതി 3 പ്രാവശ്യം)
    </p>

    <p class="malayalam text-wrap text-left fw-500">
    കർത്താവേ, മരിച്ച് ആത്മാക്കൾക്കു നിത്യാനന്ദം നൽകണമേ. നിത്യ വെളിച്ചം അവരുടെമേൽ വീശുമാറാകട്ടെ, അവർ സമാധാനത്തിൽ ആശ്വസിക്കുമാറാകട്ടെ, ആമ്മേൻ.
    </p>

`;

var novenaEndingCommon = `
    
    <p class="malayalam text-wrap text-left h4 fw-600">
    സമാപന പ്രാർത്ഥന
    </p> 
    <p class="malayalam text-wrap text-left fw-500">
    കർത്താവേ, അങ്ങയുടെ ദാസന്മാരുടെയും ദാസിമാരുടെയും മേൽ ശിക്ഷാവിധി നടത്തരുതേ. കാരണം, അങ്ങു കനിഞ്ഞു പാപങ്ങൾ ക്ഷമിക്കുന്നില്ലെങ്കിൽ ആരും അങ്ങയുടെ മുൻപിൽ നീതിമാന്മാരായിരിക്കുകയില്ലല്ലോ. ആകയാൽ കർത്താവേ, അങ്ങയോടു ഞാൻ കേണപേക്ഷിക്കുന്നു. അവിടുത്തെ മക്കൾ വിശ്വാസപൂർവ്വം കാരുണ്യത്തിനു സമർപ്പിക്കുന്ന ആത്മാക്കളുടെമേൽ അവിടുത്തെ വിധിവാചകം പതിക്കാതിരിക്കട്ടെ. മറിച്ച്, ജീവിതകാലത്ത് പരിശുദ്ധ ത്രിത്വത്തിന്റെ മുദ്ര പതിക്കപ്പെട്ട ഈ ആത്മാക്കൾ അവിടുത്തെ കൃപയാൽ ശിക്ഷാവിധിയിൽ നിന്നു മോചിതരാകട്ടെ. ആത്മാക്കൾക്കായുള്ള ഞങ്ങളുടെ ഈ പ്രാർത്ഥന കൈക്കൊണ്ട് അവരെ നിത്യമായ ശാന്തി യുടെയും സൗഭാഗ്യത്തിന്റെയും മഹത്വത്തിന്റെയും ദിവ്യപ്രകാശത്തിലേക്ക് സ്വീകരിക്കണമേ. ആമ്മേൻ.
    </p>


<!--   <p class="malayalam text-wrap text-left h4 fw-600">
    ശുദ്ധീകരണാത്മാക്കൾക്കായുള്ള സകല വിശുദ്ധരുടെ ലുത്തിനിയ
    </p>
-->

    <img class="novenaLuthiniya" src="../../resources/img/novenaLuthiniya.png" alt="Novena luthiniya">

    <p class="malayalam text-wrap text-left p p-2">
        <span class="malayalam text-wrap text-left p fw-600">സുകൃതജപം:</span>
        ഈശോയുടെ തിരുഹൃദയമേ അങ്ങേ തിരുരക്തത്താൽ ശുദ്ധീകരാത്മാക്കളെ കഴുകി വിശുദ്ധീകരിച്ചു രക്ഷിക്കണമേ 
    </p>

    <ul class="text-center">
                <li  class="d-inline px-2 fw-800">*</li>
                <li  class="d-inline px-2 fw-800">*</li>
                <li  class="d-inline px-2 fw-800">*</li>
                <li  class="d-inline px-2 fw-800">*</li>
                <li  class="d-inline px-2 fw-800">*</li>
            </ul>

`;

var vanakkamaasamLuthiniya = `
    <div class="vanakkamaasamLuthiniya">
    <img src="../../resources/img/vanakkamaasamLuthiniya/1.jpeg" alt="" class="">
    <img src="../../resources/img/vanakkamaasamLuthiniya/2.jpeg" alt="" class="">
    <img src="../../resources/img/vanakkamaasamLuthiniya/3.jpeg" alt="" class="">
    <img src="../../resources/img/vanakkamaasamLuthiniya/4.jpeg" alt="" class="">
    <img src="../../resources/img/vanakkamaasamLuthiniya/5.jpeg" alt="" class="">
    <img src="../../resources/img/vanakkamaasamLuthiniya/5.jpeg" alt="" class="">
    <img src="../../resources/img/vanakkamaasamLuthiniya/7.jpeg" alt="" class="">
    <img src="../../resources/img/vanakkamaasamLuthiniya/8.jpg" alt="" class="">
    </div>

`;


console.log(data);

function prayerNav(x){
    console.log("y = "+y);
    switch(x){
        
        case 1:
            {
                Novena.classList = Novena.classList.remove("d-none");
                y = 1;
                break;
            }
        case 2:
            {
                vanakkamaasam.classList = vanakkamaasam.classList.remove("d-none");
                y = 2;
                break;
            }
    }
    pauseKarunaKontha();
}

function display(x){
    switch(x){
        case 1:
            { 
                contentDiv.innerHTML = `
                        <p class="malayalam fw-500 h5 text-wrap text-center h5 text-wrap text-break">ആയിരം ആത്മാക്കളുടെ  പ്രാർത്ഥന</p>

                        <p class="p malayalam text-secondary blockquote text-wrap text-break"> ഒരുതവണ ചൊല്ലിയാൽ ആയിരം ആത്മാക്കളെ ശുദ്ധീകരണസ്ഥലത്തുനിന്നും മോചിപ്പിക്കുമെന്ന് വാഗ്ദാനം ചെയ്തുകൊണ്ട് ഈശോ വി. ജെത്രൂദിനെ പഠിപ്പിച്ച പ്രാർത്ഥന </p>
                        <p class="malayalam fw-500 h5 text-wrap h5 text-wrap text-break">
                            നിത്യനായ ദൈവമേ ഇന്നേദിവസം അർപ്പിക്കപ്പെടുന്ന എല്ലാ ബലികളോടും ചേർത്ത് അങ്ങേ പ്രിയപുത്രനായ ഈശോമിശിഹായുടെ തിരുരക്തം ശുദ്ധീകരണസ്ഥലത്തുള്ള ആത്മാക്കൾക്കായും ലോകമെങ്ങുമുള്ള പാപികൾക്കും സഭയിലുള്ള പാപികൾക്കും എന്റെ കുടുംബത്തിലെയും എന്റെ ഭവനത്തിലെയും പാപികൾക്കായും ഞാൻ കാഴ്ചസമർപ്പിക്കുന്നു <br><br>
                            1.സ്വർഗ്ഗ. 1.നന്മ 1.ത്രിത്വ 
                        </p>
                `;
                pauseKarunaKontha();                
                console.log("Prayer to help 1000 souls loaded");
                break;
            }
        case 2:
            {
                karunakontha();
                break;
            }
    }
}

function karunakontha(){
    audio.loop = true;
    audio.currentTime = 0;
    audio.muted = false;
    audio.play();
    audio.loop = true;
    audio.play();
    contentDiv.innerHTML = `
        <p class="p malayalam fw-500 h3  text-center text-wrap text-break">കരുണയുടെ ജപമാല </p>
        <img class="img-fluid w-100 h-100 img-thumbnail" src="../../resources/img/divineMercy.jpg" alt="">
        <p class="p malayalam fw-500 h5 mt-3 py-2">ഓ, ഏറ്റവും കരുണയുള്ള ഈശോയുടെ തിരുഹൃദയമേ ലോകത്തിന്റെമേൽ കരുണയായിരിക്കണേ </p>

    `
    console.log("Karunakontha loaded;");
}


function novena(x){
    contentDiv.innerHTML = 
        `   
            <p class="malayalam fw-500 text-wrap h2 text-center text-secondary text-wrap text-break">നൊവേന</p>
            <p class="malayalam fw-500 text-wrap h5 text-center ">${data.novena[x-1].day}</p>
        `
        + novenaStartingCommon +
        `
            <p class="malayalam fw-500 text-wrap h5 text-center py-1 pt-2 text-wrap text-break">
                ഇന്നേ ദിവസത്തിലെ പ്രത്യേക പ്രാർത്ഥന 
            </p>
        ` 
        +
        `
            <p class="p letterSpacing malayalam text-wrap text-break">${data.novena[x-1].prayer}</p>
        ` 
        + novenaEndingCommon;

    pauseKarunaKontha();
    console.log("novena day " + x +" loaded;");
  }


function vanakkmaasam(x){
    contentDiv.innerHTML = 
    `
        <div class="vanakkamaasamDaysDiv m-0 p-0">
            <p class="h3 malayalam text-center text-wrap text-break">
                വണക്കമാസം <br>
                <span class="text-secondary">Nov ${x}</span>
            </p>

            <hr class="hr-default">

            <p class="h5 malayalam text-wrap text-break">ഇന്നത്തെ ചിന്താവിഷയം</p>
            <p class="malayalam " id="topic">
                ${data.vanakkamaasam[x-1].topic}
            </p>

            <hr class="hr-default">

            <p class="h5 malayalam text-wrap text-break">ധ്യാനിക്കാം </p>
            <p class="malayalam text-wrap text-break" id="upadesham">
                ${data.vanakkamaasam[x-1].advice}
            </p>

            <hr class="hr-default">

            <p class="h5 malayalam ">പ്രാർത്ഥന</p>
            <p class="malayalam text-wrap text-break" id="prayer">
                ${data.vanakkamaasam[x-1].prayer}
            </p>

            <hr class="hr-default">

            <p class="malayalam">
            <span class="malayalam font-weight-bold d-block">താഴെ വരുന്ന പ്രാർത്ഥന 5 പ്രാവശ്യം ചൊല്ലുക</span>
            1സ്വർഗ്ഗ. 1നന്മ 1ത്രിത്വ <br> 
            മരിച്ച വിശ്വാസികളുടെ ആത്മാക്കൾക്കു തമ്പുരാന്റെ മനോഗുണത്താൽ മോക്ഷത്തിൽ സമാധാനമുണ്ടായിരിക്കട്ടെ.  <br><br> നിത്യപിതാവേ! ഈശോമിശിഹാ കർത്താവിന്റെ വിലമതിയാത്ത തിരുച്ചോരയെക്കുറിച്ച് ഇവരുടെമേൽ കൃപയായിരിക്കണമേ. 
            </p>

            <hr class="hr-default">

            <p class="h5 malayalam">ലുത്തിനിയ</p>
            <p class="malayalam text-wrap text-break" id="vanakkamasamConclution">
                ${vanakkamaasamLuthiniya}
            </p>

            <hr class="hr-default">

            <p class="h5 malayalam">സുകൃതജപം</p>
            <p class="malayalam text-wrap text-break" id="sukruthajapam">
                ${data.vanakkamaasam[x-1].sukrithajapam}
            </p>

            <hr class="hr-default">


            <p class="h5 malayalam">സൽക്രിയ </p>
            <p class="malayalam text-wrap text-break" id="salkriya">
                ${data.vanakkamaasam[x-1].salkriya}
            </p>

            <hr class="hr-default">
        </div>

    `
    pauseKarunaKontha();
    console.log("vanakkamaasam day " + x +" loaded;");
  }
  
  function japamala(){
    contentDiv.innerHTML = `
        <div id="japamala" class="">
        <p class="malayalam h4 text-center text-wrap text-break">ശുദ്ധീകരാത്മാക്കൾക്കായുള്ള ജപമാല</p>
        <p class="malayalam h5 text-center">പ്രാരംഭപ്രാർഥന </p>
        <p class="malayalam fw-600 text-wrap text-break">                      
            കർത്താവേ, ഞങ്ങളുടെ ഹൃദയത്തിലെ വ്യർത്ഥവും അശുദ്ധവുമായ ചിന്തകളകറ്റി അതിനെ ജ്വലിപ്പിക്കണമേ. അവിടുത്തെ പിഡാനുഭവത്തെയും മരണത്തെയും അതിലുപരി അവിടുത്തെ മാതാവിന്റെ വേദനകളെയും ധ്യാനിക്കാൻ ഞങ്ങളുടെ മനസ്സുകളെ പ്രകാശിപ്പിക്കണമേ. ഞങ്ങൾ സമർപ്പിക്കുന്ന പ്രാർത്ഥനകൾ അവിടുത്തെ തിരുസന്നിധിയിലെത്തുമാറാകട്ടെ, എന്നെന്നും ജീവിച്ചു വാഴുന്ന അങ്ങ് ഞങ്ങളുടെ ഈ പ്രാർത്ഥന കേട്ടരുളണമേ, ആമ്മേൻ.
        </p>

        <p class="malayalam fw-500 text-left small text-wrap text-break">(കൊന്തയിലെ ‘സ്വർഗ്ഗസ്ഥനായ പിതാവേ’ എന്ന പ്രാർത്ഥനയുടെ സ്ഥാനത്തു ചൊല്ലേണ്ട പ്രാർത്ഥന):</p>
        <p class="malayalam fw-600 text-left text-wrap text-break">
            ഏറ്റവും കാരുണ്യവാനായ ഈശോയേ, അങ്ങ് പീഡയനുഭ വിച്ച് മരിച്ചു രക്ഷിച്ച്, പരേതരായ വിശ്വാസികളുടെമേൽ കരുണയാ യിരിക്കണമേ.
        </p>

        <p class="malayalam fw-500 text-left small text-wrap text-break">
            ('നന്മ നിറഞ്ഞ മറിയമേ' എന്ന പ്രാർത്ഥനയുടെ സ്ഥാനത്തു ചൊല്ലേണ്ടത്):
        </p>

        <p class="malayalam fw-600 text-left text-wrap text-break">
            <span class="malayalam p-2 mx-2 d-block text-wrap text-break">
                എന്റെ ഈശോയേ, അങ്ങ് ഗത്സെമനിയിൽ വച്ച് രക്തം വിയർത്തതോർത്ത്, ശുദ്ധീകരണാത്മാക്കളോടു കരുണയായിരിക്കണമേ
            </span>

            <span class="malayalam p-2 mx-2 d-block text-wrap text-break">
                എന്റെ ഈശോയേ, അവിടുത്തെ തിരുമുഖത്ത് ഏറ്റ പ്രഹരത്തെയോർത്ത്, ശുദ്ധീകരണാത്മാക്കളോടു കരുണയായിരിക്കണമേ
            </span>

            <span class="malayalam p-2 mx-2 d-block text-wrap text-break">
                എന്റെ ഈശോയേ, അവിടുന്ന് ഏറ്റ ക്രൂരമായ ചാട്ടവാറടികളെയോർത്ത്, ശുദ്ധീകരണാത്മാക്കളോടു കരുണയായിരിക്കണമേ
            </span>

            <span class="malayalam p-2 mx-2 d-block text-wrap text-break">
                എന്റെ ഈശോയേ, അങ്ങയുടെ ശിരസ്സിൽ ആഴ്ന്നിറങ്ങിയ മുൾമുടിയെ ഓർത്ത്, ശുദ്ധീകരണാത്മാക്കളോടു കരുണയായിരിക്കണമേ
            </span>

            <span class="malayalam p-2 mx-2 d-block text-wrap text-break">
                എന്റെ ഈശോയേ, ഭാരമേറിയ കുരിശുവഹിച്ച് ദുർഘട വഴികളിലൂടെ അവിടുന്ന് നടന്നതിനെയോർത്ത്, ശുദ്ധീകരണാത്മാക്കളോടു കരുണയായിരിക്കണമേ.
            </span>

            <span class="malayalam p-2 mx-2 d-block text-wrap text-break">
                എന്റെ ഈശോയേ, വെറോനിക്കയുടെ തൂവാലയിൽ പതിഞ്ഞ അവിടുത്തെ തിരുരക്തത്തെയോർത്ത്, ശുദ്ധീകരണാത്മാക്കളോടു കരുണയായിരിക്കണമേ.
            </span>

            <span class="malayalam p-2 mx-2 d-block text-wrap text-break">
                എന്റെ ഈശോയേ, അവിടുത്തെ ശരീരത്തിൽ ഒട്ടിപ്പിടിച്ച വസ്ത്രം ക്രൂരമായി ഉരിഞ്ഞെടുത്തതിനെയോർത്ത്, ശുദ്ധീകരണാത്മാക്കളോടു കരുണയായിരിക്കണമേ.
            </span>

        <span class="malayalam p-2 mx-2 d-block text-wrap text-break">
            എന്റെ ഈശോയേ, അങ്ങയെ കുരിശിൽ തറച്ചതിനെയോർത്ത്, ശുദ്ധീകരണാത്മാക്കളോടു കരുണയായിരിക്കണമേ.
        </span>

            <span class="malayalam p-2 mx-2 d-block text-wrap text-break">
                എന്റെ ഈശോയേ, അവിടുത്തെ കൈകളിലും കാലുകളിലും കൂർത്ത ആണികൾ തറച്ചതിനെയോർത്ത്, ശുദ്ധീകരണാത്മാക്കളോടു കരുണയായിരിക്കണമേ.
            </span>

            <span class="malayalam p-2 mx-2 d-block text-wrap text-break">
                എന്റെ ഈശോയേ, അവിടുത്തെ പാർശ്വം കുത്തിപ്പിളർന്ന് രക്തവും വെള്ളവും ഒഴുകിയതിനെയോർത്ത്, ശുദ്ധീകരണാത്മാക്കളോടു കരുണയായിരിക്കണമേ.
            </span>
        </p>

        
        <p class="malayalam h5 text-center">ജപമാല സമർപ്പണം </p>
        <p class="malayalam fw-600 p-2 mx-2 d-block text-wrap text-break">
            ഏറ്റവും മാധുര്യവാനായ ഈശോയേ, അങ്ങ് ലോകത്തെ രക്ഷിക്കാൻ മനുഷ്യാവതാരം ചെയ്യാൻ, പരിഛേദനത്തിനു വിധേയനാകാൻ, യഹൂദരാൽ നിന്ദിക്കപ്പെടാൻ, യൂദാസിന്റെ വഞ്ചന നിറഞ്ഞ ചുംബനത്താൽ ശത്രുകരങ്ങളിൽ ഏല്പിക്കപ്പെടാൻ, ബന്ധിക്കപ്പെട്ട് ബലിക്കളത്തിലേക്ക് കുഞ്ഞാടിനെപ്പോലെ നയിക്കപ്പെടാൻ, കയ്യഫാസി ന്റെയും പീലാത്തോസിന്റെയും ഹേറോദേസിന്റെയും മുൻപിൽ അവഹേളിക്കപ്പെടാൻ, മുഖത്തു തുപ്പി അന്യായമായ കള്ളസാക്ഷ്യം ചുമത്തി മരണത്തിനു വിധിക്കപ്പെടാൻ, മുഖത്തടിച്ച് ചമ്മട്ടിയടിയാൽ ദേഹം മുഴുവൻ കീറിമുറിക്കപ്പെടാൻ, ശിരസ്സിൽ മുൾക്കിരീടം ചാർത്തി മുഖം ഒരു ചുവന്ന തുണികൊണ്ടുമൂടി പരിഹസിക്കപ്പെടാൻ, വസ്ത്രം ഉരിഞ്ഞ് കുരിശിൽ രണ്ടു കള്ളന്മാരുടെ നടുവിൽ അവരിലൊരുവനെപ്പോലെ തറയ്ക്കപ്പെടാൻ, മീറകലർത്തിയ വീഞ്ഞു കുടിക്കാൻ, കുന്തത്താൽ കുത്തപ്പെടാൻ തിരുമനസ്സായ കർത്താവേ, അങ്ങയുടെ ദാരുണമായ പീഡാനുഭവമോർത്ത് ശുദ്ധീകരണാത്മാക്കളെ അവരുടെ വേദനകളിൽനിന്നു മോചിപ്പിച്ച് അവിടുത്തെ സ്വർഗ്ഗീയ മഹത്വത്തിൽ പ്രവേശിപ്പിക്കണമേ. അങ്ങയുടെ പീഡാനുഭവമരണ യോഗ്യതകളാൽ, അവിടുത്തോടൊന്നിച്ചു ക്രൂശിക്കപ്പെട്ട നല്ല കള്ളനെ പ്രവേശിപ്പിച്ച പറുദീസായിൽ ഞങ്ങളെയും പ്രവേശിപ്പിക്കണമേ, എന്നെന്നും ജീവിച്ചു വാഴുന്ന അങ്ങ് ഞങ്ങളുടെ പ്രാർത്ഥന കേട്ടരുളണമേ, ആമ്മേൻ 
        </p>
        <img class="novenaLuthiniya" src="../../resources/img/novenaLuthiniya.png" alt="Novena luthiniya">
    </div>
`
    pauseKarunaKontha();
    console.log("Japamala loaded");
  }

function pauseKarunaKontha(){
    audio.muted = true;
}

